Revit 2027 API
ParameterTypeId.StairsRunWinderEndWithStraight Property
 "End with Straight Run": Winder end with straight run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunWinderEndWithStraight { get; }
Public Shared ReadOnly Property StairsRunWinderEndWithStraight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunWinderEndWithStraight {
	ForgeTypeId^ get ();
}
static member StairsRunWinderEndWithStraight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace